In [4]:
import pandas as pd
from sklearn import linear_model

In [46]:
df=pd.read_csv('D:\Jupyter Sketch\Smash (19)\homeprices.csv')

In [47]:
df

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

In [51]:
df2=df.drop('price',axis='columns')

In [52]:
df2

   area
0  2600
1  3000
2  3200
3  3600
4  4000

In [53]:
#price=df.price

In [58]:
#price

In [59]:
reg=linear_model.LinearRegression()

In [60]:
reg.fit(df2,df.price)

LinearRegression()

In [70]:
reg.predict([[5000]])

array([859554.79452055])

In [62]:
reg.coef_

array([135.78767123])

In [63]:
reg.intercept_

180616.43835616432

In [65]:
reg.score(df2,df.price)

0.9584301138199486

In [71]:
import pandas as pd
from sklearn import linear_model

In [72]:
df=pd.read_csv('D:\Jupyter Sketch\Smash (20)\homeprices.csv')

In [73]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [83]:
df.bedrooms.median()

4.1

In [84]:
df.bedrooms=df.bedrooms.fillna(df.bedrooms.median())

In [85]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.2   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [87]:
df2=df.drop('price',axis='columns')

In [88]:
df2

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.2   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [86]:
reg=linear_model.LinearRegression()

In [89]:
reg.fit(df2,df.price)

LinearRegression()

In [90]:
reg.coef_

array([  116.66950551, 18756.28806982, -3675.75111708])

In [91]:
reg.intercept_

231586.00639409176

In [102]:
reg.predict([[3600,3,30]])

array([597592.55691169])

In [97]:
reg.score(df2,df.price)

0.9540926625396438